Repository: BuzzTheGamer23/canvas-ios15
Catalog: Frameworks/MediaKit/MediaKit/*.lproj/Localizable.strings
Languages: mi

source: Begin recording
mi: Timata tuhi

source: Cancel
mi: Whakakore

source: Delete
mi: Mukua

source: Delete recording?
mi: Mukua tuhi?

source: Dismiss
mi: Tonoa

source: Not Permitted
mi: e kore e Taea

source: Pause
mi: Okioki

source: Pause playback
mi: purei okioki

source: Play
mi: Tākaro

source: Play back recording
mi: tuhi anō

source: Playback Error
mi: Hapa anō

source: Record Permission Help
mi: Record Āwhina Whakaaetanga

source: Recording Error
mi: Tuhi Hapa

source: Request Audio Recording Permission
mi: Tono Ororongo Tuhi Whakaaetanga

source: Request Permission to record audio
mi: Tono Whakaaetanga ki te Record ororongo

source: Stop
mi: Kāti

source: The file does not exist.
mi: Kāore i te tīariari te kōnae.

source: User has denied record permission
mi: He whakakahore whakaaetanga record Kaiwhakamahi

source: You must grant (appName) Microphone access in the Settings app in order to record audio.
mi: Me homai e koe (appName) uru Hopuoro i roto i te taupānga Tautuhinga i roto i te tikanga ki te record audio.
