Repository: BuzzTheGamer23/canvas-ios15
Catalog: Frameworks/Enrollments/EnrollmentKit/*.lproj/Localizable.strings
Languages: mi

source: All Grading Periods
mi: Takiwā Māka Katoa

source: Blue
mi: Puru

source: Customize
mi: Whakaritea

source: Cyan
mi: Kawariki

source: DeepOrange
mi: Orange hohonu

source: DeepPurple
mi: hohonu Waiporoporo

source: Favorites
mi: Makau

source: Grading Periods
mi: Takiwā Māka

source: Green
mi: Matomato

source: Hidden
mi: Huna

source: Indigo
mi: Poropango

source: LightBlue
mi: Puru Te marama

source: LightGreen
mi: Kākāriki Marama

source: LightPink
mi: Māwhero Marama

source: Pink
mi: Māwhero

source: Purple
mi: Waiporoporo

source: Red
mi: Whero

source: Selected
mi: Tīpakohia

source: Teal
mi: Päteke

source: There was a problem loading the EnrollmentKit database file.
mi: He ko he raru uta i te kōnae Kit pātengi raraunga Whakauru.

source: There was an error associating a tab with a course or group.
mi: I hapa te amui i te ripa ki te akoranga rōpū ranei.

source: Total Grade
mi: Kōeke Tapeke

source: Yellow
mi: Kōwhai
