Repository: BuzzTheGamer23/canvas-ios15
Catalog: Canvas/TechDebt/*.lproj/Localizable.strings
Languages: mi

source: Video
mi: Ataata

source: Video error
mi: hapa ataata

source: View
mi: Tirohia

source: Warning
mi: Whakatūpato

source: We had a problem loading the submission. Please try again later.
mi: i matou i te raruraru te uta i te tāpaetanga. Koa ngana anō i muri mai.

source: We were unable to verify the server for use with this app.
mi: i taea ki te manatoko i te tūmau mō te whakamahi ki tenei taupānga matou.

source: Will unlock %@.
mi: E iriti %@.

source: Would you like to create a new message?
mi: E hiahia ana koe ki te waihanga i tētahi karere hou?

source: Would you mind giving us a rating on the app store?
mi: E whakaaro hoatu koe matou he whakatauranga runga i te toa taupānga?

source: Would you mind letting us know the problems you have been having with the app?
mi: E whakaaro koutou tuku matou e mohio ki te mau fifi i koe he ki te taupānga?

source: Yes
mi: Ae

source: You are now masquerading as %@
mi: E whakaahua koe i teie nei rite %@

source: You are now masquerading as %@. To Stop Masquerading go to your Profile.
mi: E whakaahua koe i teie nei rite %@. Ki Kati whakaahua haere ki tō kōtaha.

source: You do not have SpeedGrader for iPad. You can download it for free from the App Store.
mi: e kore koe e whai SpeedGrader mo iPad. Ka taea e koe te tiki i te reira no te kore utu i te store taupānga.

source: You do not have access to this content. The Course or Group may not have started, or may have been concluded.
mi: e kore koe e whai wāhi ki tenei ihirangi. kore ai i tīmata te Akoranga Rōpū ranei, kua mutu ai ranei.

source: You do not have permission to delete this reply
mi: e kore koe e whai whakaaetanga ki te muku i tēnei whakautu

source: You don't have permission to masquerade as this user or there is no user with that ID
mi: e kore koe e whai whakaaetanga ki te whakaahua ke ano tenei kaiwhakamahi ranei kahore he kaiwhakamahi ki taua ID

source: You have an unsaved reply. Would you like to discard that reply?
mi: E koe te whakautu i tiakina. E rite koe ki te tūraki i te whakautu?

source: You have no files available for upload. To add files from other apps, find a file in another app, then find the "Open In" button to open it in Canvas. You can also tap and hold on attachments in the Mail app to open them in Canvas.
mi: Kaore he kōnae mau hei tukuatu. Hei tāpiri ngā kōnae mai i tētahi atu taupanga, kitea he kōnae i roto i tētahi atu taupanga, ā kitea te “ Whakatuwhera i roto” pātene ki te whakatuwhera i roto i Canvas. Ka taea hoki e koe ki te pato me te mau i runga i ngā āpitihanga i roto i te Mēra taupanga ki te whakatuwhera ia rātou i roto i Canvas.

source: You must first complete:
mi: Me whakaoti koe i te tuatahi:

source: You need a title and a description to post
mi: Me koe te taitara me te whakamārama ki te tuku

source: You should go rate Canvas on the App Store!
mi: Kia haere koe auau Kanaweti i runga i te toa taupānga!

source: Your files could not be found
mi: kihai koutou kōnae i kitea

source: Your school's configuration does not allow the type of submission selected for this assignment
mi: e kore e whirihoranga o tou kura tukua te momo o te tāpaetanga tīpakohia mō tenei taumahi

source: due on %1$@ at %2$@
mi: e tika ana i runga i %1$@ i %2$@

source: due on %@ at %@
mi: e tika ana i runga i %1$@ i %2$@

source: moments ago
mi: taime i ma'iri a'e

source: out of
mi: i roto i te

source: out of %@
mi: i roto i te %@

source: out of %@ points
mi: i roto i te ngā %@

source: until %@
mi: Tae noa ki %@
