Repository: BuzzTheGamer23/canvas-ios15
Catalog: Canvas/TechDebt/*.lproj/Localizable.strings
Languages: mi

source: You must first complete:
mi: Me tuatahi whakaoti koe:

source: until %@
mi: tae noa ki %@

source: "%@" is locked as part of "%@"
mi: kiia "%1$@" te hei wāhanga o "%2$@"

source: %0.2f MB
mi: %0.2f MP

source: %1$@ (%2$g out of %3$@)
mi: %1$@ (%2$g i roto i te %3$@)

source: %1$@ at %2$@
mi: %1$@ i %2$@

source: %1$@ is due in %2$@
mi: He tika i roto i te %2$@ %1$@

source: %1$@ out of %2$@
mi: %1$@ i roto i te %2$@

source: %1$@%% (%2$g out of %3$@)
mi: %1$@%% (%2$g i roto i te %3$@)

source: %1$@. %2$@. Type: %3$@.
mi: %1$@. %2$@. Momo: %3$@.

source: %1$@. %2$@. Type: %3$@. Status: %4$@
mi: %1$@. %2$@. Momo: %3$@. Tūnga: %4$@

source: %1$g out of %2$@
mi: %1$g i roto i te %2$@

source: %@ (%d)
mi: %1$@ (%2$d)

source: %@ (%g out of %@)
mi: %1$@ (%2$g i roto i te %3$@)

source: %@ at %@
mi: %1$@ i %2$@

source: %@ is coming soon!
mi: Kei te haere mai hohoro %@!

source: %@ is due in %@
mi: He tika i roto i te %2$@ %1$@

source: %@ is locked
mi: kiia %@ te

source: %@ is not a valid URL
mi: e kore he %@ he URL whaimana

source: %@ is not a valid host
mi: e kore he %@ he ope whaimana

source: %@ is not currently supported.
mi: e kore te tautoko %@ tēnei wā.

source: %@ likes
mi: momo %@

source: %@ need grading
mi: %@ Māka matea

source: %@ out of %@
mi: %1$@ i roto i te %2$@

source: %@%% (%g out of %@)
mi: %1$@%% (%2$g i roto i te %3$@)

source: %d %@
mi: %1$d %2$@

source: %d days ago
mi: %d ra i mua

source: %d hours ago
mi: %d haora mua

source: %d items
mi: %d ngā tūemi

source: %d minutes ago
mi: %d meneti mua

source: %d months ago
mi: %d marama mua

source: %d more
mi: %d atu

source: %d replies
mi: %d whakautu

source: %d unread
mi: %d pānuihia

source: %d years ago
mi: %d tau mua

source: %qu bytes
mi: %qu paita

source: %tu day
mi: %tu ra

source: %tu days
mi: %tu rua

source: %tu hour
mi: %tu haora

source: %tu hours
mi: %tu haora

source: %tu minute
mi: %tu meneti

source: %tu minutes
mi: %tu meneti

source: %u Attachments
mi: Āpitihanga %u

source: %u files
mi: kōnae %u

source: &quot;%1$@&quot; is locked as part of &quot;%2$@&quot;
mi: &quot;%1$@&quot; kei te raka i te wāhanga o &quot;%2$@&quot;

source: '%@' is now ready to submit to assignments
mi: '%@' He inaianei rite ki te tuku ki ohipa

source: 1 Attachment
mi: 1 Āpitihanga

source: 1 day
mi: 1 ra

source: 1 day ago
mi: 1 ra i mua

source: 1 hour
mi: 1 haora

source: 1 hour ago
mi: 1 haora i mua

source: 1 item
mi: 1 tūemi

source: 1 like
mi: 1 rite

source: 1 minute ago
mi: 1 meneti i mua

source: 1 month ago
mi: 1 marama i mua

source: 1 needs grading
mi: 1 hiahia māka

source: 1 year ago
mi: 1 tau i mua

source: 3 days
mi: 3 ra

source: 5 minutes
mi: 5 meneti

source: About
mi: Mō

source: Access Denied
mi: Aukatia te Uru

source: Access denied. Please check your permissions for the action you're trying to complete.
mi: whakakahore uru. Koa tirohia koutou whakaaetanga mo te mahi e ngana ana koe ki te whakaoti.

source: Add Attachment
mi: Tāpiri Āpitihanga

source: Add Comment
mi: Tāpiri Tākupu

source: Add Cover Photo
mi: Tāpiri Cover Whakaahua

source: Add a folder
mi: Tāpiri i te kōpaki

source: Add attachment
mi: Tāpiri āpitihanga

source: Add comment
mi: Tāpiri kōrero

source: Add folder
mi: Tāpiri kōpaki

source: Add inline media
mi: Tāpiri pāpāho rōraina

source: Add recipients
mi: Tāpiri kaiwhiwhi

source: All members
mi: te mau melo katoa

source: An unknown error occurred
mi: He hapa tē mōhiotia puta

source: Announcement
mi: Pānuitanga

source: Announcements
mi: Fanongonongó

source: Archive
mi: Pūranga

source: Archive Selected Messages
mi: Pūranga ngā karere kua tīpokahia

source: Archive Selected Messages Button
mi: Pātene Pūranga Tīpakohia Karere

source: Archive all selected messages
mi: Pūranga ngā karere katoa i tīpakohia

source: Archived
mi: Pūrangatia

source: Are you ready to logout?
mi: Kei te rite ki te takiputa koe?

source: Are you sure you want to submit this Arc video for this assignment?
mi: E pono ana koe kei te hiahia koe ki te tuku i tēnei Arc ataata mo tēnei taumahi?

source: Ask me later
mi: A ani i ahau i muri

source: Assignment
mi: Taumahi

source: Assignments
mi: Taumahi

source: Attachment
mi: Āpitihanga

source: Attachment %d
mi: Āpitihanga %d

source: Attachment %i
mi: Āpitihanga %i

source: Attachments
mi: Āpitihanga

source: Attendance
mi: Te haereraa i

source: Audio
mi: Ororongo

source: Audio input hardware not available
mi: pūmārō tāuru ororongo kore e wātea ana

source: Authentication error
mi: hapa motuhēhēnga

source: Build Avatar
mi: Hanga Avatar

source: Cache cleared
mi: whakawāteatia Keteroki

source: Calendar
mi: Maramataka

source: Can't load tool
mi: e kore e taea te uta taputapu

source: Can't submit media
mi: Kāore e taea te tuku pāpāho

source: Cancel
mi: Whakakore

source: Cancel Message
mi: Whakakore Karere

source: Canvas appears to be unavailable. Please try again later.
mi: puta Kanaweti ki kia wātea. Koa ngana anō i muri mai.

source: Canvas failed to find recipients for your current search. Please try again later.
mi: rahua Kanaweti ki te kitea kaiwhiwhi mo koutou rapu o nāianei. Koa ngana anō i muri mai.

source: Canvas quizzes support various assessment styles. Most of these styles are supported on mobile devices; however, some are not. If you attempt to take one of these unsupported quizzes on your phone, you might be unable to complete the entire quiz, leaving you at a disadvantage. Unsupported question types include questions containing Adobe Flash™ content, file uploads, and others. If you believe that a quiz contains unsupported content, please take it on desktop or laptop computer. If you know that the quiz contains only supported content, feel free to take it on your mobile device.
mi: pātaitai tautoko ngā momo aromatawai kānawehi. E tautokona te nuinga o enei momo i runga i ngā pūrere pūkoro; Heoi, e kore e etahi. Ki te ngana koe ki te tango i tetahi o enei kuihi tautokona i runga i tou waea, ai waiho koe taea ki te whakaoti i te pātaitai katoa, mahue koe i te ngoikoretanga. momo pātai tētautokohia ngā pātai kei roto Adobe Flash ™ ihirangi, tukunga kōnae, me ētahi atu. Ki te whakapono koe e kei he quiz ihirangi tautokona, tēnā tango i te reira i runga i papamahi pona rorohiko ranei. Ki te mohio koe e te pātaitai kei roto tautoko ihirangi anake, ite noa ki te tango i te reira i runga i tō pūrere pūkoro.

source: Change Profile Image
mi: Tīni i te Kōtaha Āhua

source: Change User
mi: Huri Kaiwhakamahi

source: Choose Photo
mi: Kōwhiri Photo

source: Choose Profile Picture
mi: Kōwhiri Pikitia Kōtaha

source: Choose Video
mi: Kōwhiri Ataata

source: Choose a name for the new folder
mi: Kōwhiria he ingoa mo te kōpaki hōu

source: Choose a name for the new folder.
mi: Kōwhiria he ingoa mo te kōpaki hōu.

source: Choose a submission type
mi: Kōwhiria he momo tāpaetanga

source: Choose from Library...
mi: Kōwhiri i Puna ...

source: Choose video
mi: Kōwhiri ataata

source: Close
mi: Katia

source: Closed for Comments
mi: Katia hoki Tākupu

source: Collaborations
mi: Tahi

source: Comment
mi: Tākupu

source: Comment Error
mi: Hapa Tākupu

source: Comments
mi: Tākupu

source: Comments are disabled
mi: He monokia Tākupu

source: Complete
mi: Whakaotia

source: Completed
mi: Oti

source: Compose Message
mi: Tito Karere

source: Compose Message Button
mi: Titoa Pātene Karere

source: Compose a message
mi: Tuhia he

source: Conferences
mi: ngaahi konifelenisi

source: Confirm Submission
mi: Whakatau Tukunga

source: Confirm deletion
mi: Whakaūngia te mukunga

source: Continue
mi: Tonu

source: Could not authenticate with server
mi: Kāore i taea te whakamotuhēhē ki tūmau

source: Couldn't Load Submission
mi: e kore i taea te whakawaha Tukunga

source: Couldn't find recipients
mi: Kāore i kitea kaiwhiwhi

source: Course Syllabus
mi: Marautanga Akoranga

source: Courses
mi: Kōhi

source: Create Folder
mi: Waihanga Kōpaki

source: Current Submission
mi: Tāpaetanga O nāianei

source: Currently there is limited quiz support on mobile
mi: I tēnei wā i reira he iti tautoko pātaitai i runga i pūkoro

source: Custom Grade
mi: Kōeke Ritenga

source: Customize
mi: Whakaritea

source: Delete
mi: Mukua

source: Delete (%d)
mi: Mukua (%d)

source: Delete this reply?
mi: Mukua tenei whakautu?

source: Deleted file: "%@"
mi: kōnae Mukua: "%@"

source: Deleted file: &quot;%@&quot;
mi: Mukua te kōnae &quot;%@&quot;

source: Detail
mi: Taipitopito

source: Details
mi: Taipitopito

source: Discard
mi: Tūraki

source: Discard this entry?
mi: Tūraki tenei tāurunga?

source: Discussion
mi: Aparauraa

source: Discussion Entry
mi: Tāurunga Aparauraa

source: Discussion Topics
mi: kaupapa Aparauraa

source: Discussions
mi: Kōrero

source: Dismiss
mi: Tonoa

source: Do you want to masquerade as this user?
mi: E hiahia ana koe ki te whakaahua ke ano tenei kaiwhakamahi?

source: Domain
mi: Rohe

source: Don't ask me again
mi: Kaua e ui ano ahau

source: Don't delete
mi: Kaua e muku

source: Done
mi: Mahia

source: Download Canceled
mi: Tikiake Whakakorea

source: Downloading...
mi: Tikiake ana ...

source: Due:
mi: Nā:

source: Due: %1$@ at %2$@
mi: Nā: %1$@ i %2$@

source: Due: %@
mi: E tika ana: %@

source: Edit
mi: Whakatika

source: Edit Course List
mi: Whakatika Rārangi Akoranga

source: Edit Group List
mi: Rārangi Whakatika Rōpū

source: Edit items
mi: Whakatika tūemi

source: Editing reply by %1$@, %2$@
mi: Whakarerekē whakautu e %1$@, %2$@

source: Editing reply by %@, %@
mi: Whakarerekē whakautu e %1$@, %2$@

source: Email
mi: Īmēra

source: Enable Push Notifications
mi: Whakahohea Whakamōhiotanga Pana

source: Enter User ID and Domain.
mi: Tomo ID Kaiwhakamahi me te Rohe.

source: Enter submission
mi: Tomo tukunga

source: Entry posted
mi: whakairi tāurunga

source: Error
mi: Hapa

source: Error adding recipeints
mi: Hapa tāpiri kaiwhiwhi

source: Error adding recipients
mi: He hapa i te wā e tāpiri ana i ngā kaiwhiwhi

source: Error deleting file "%@"
mi: kōnae te muku Hapa "%@"

source: Error deleting file &quot;%@&quot;
mi: I hapa te mukuna i te kōnae &quot;%@&quot;

source: Error deleting folder
mi: kōpaki te muku Hapa

source: Event
mi: Takahanga

source: Existing Attachments...
mi: Ngā Āpitihanga ...

source: External Tool
mi: Taputapu Waho

source: External URL
mi: URL Waho

source: File
mi: Kōnae

source: File extension not allowed: %@
mi: toronga Kōnae kore whakaaetia: %@

source: File extension(s) permitted for this assignment:
mi: Ka whakaaetia he toronga kōnae (ngā) mō tēnei taumahi

source: File received
mi: riro Kōnae

source: File unavailable
mi: Kōnae wātea

source: File upload
mi: tukunga Kōnae

source: File upload failed.
mi: I rahua te tukunga Kōnae.

source: Files
mi: Kōnae

source: Finished downloading
mi: tikiake oti

source: Front Page
mi: Whārangi Mua

source: Future
mi: heke mai

source: Go To Discussion
mi: Haere ki te Aparauraa

source: Go to App Store
mi: Haere ki te Toa Taupānga

source: Go to Quiz
mi: Haere ki te Pātaitai

source: Go to discussion
mi: Haere ki te kōrero

source: Grade
mi: Kōeke

source: Grade %@
mi: Kōeke %@

source: Grade in SpeedGrader
mi: Kōeke i SpeedGrade

source: Grade: %1$i / %2$g
mi: Kōeke: %1$i / %2$g

source: Grade: %@
mi: Kōeke: %@

source: Grade: %i / %g
mi: Kōeke: %1$i / %2$g

source: Graded Discussion
mi: Aparauraa Mākahia

source: Graded discussion.
mi: kōrero Mākahia.

source: Graded discussion. %g points possible.
mi: kōrero Mākahia. tohu taea %g.

source: Grades
mi: Kōeke

source: Group conversation
mi: whakahaere rōpū

source: Groups
mi: Rōpū

source: Help
mi: Āwhina

source: Hide Grades
mi: Huna Kōeke

source: How do you like Canvas?
mi: Kia pehea te mahi koe rite Kanaweti?

source: I give you back your time, use it wisely.
mi: hoatu e ahau ki te hoki koe tou wa, te whakamahi i te reira te paari.

source: Import from Dropbox
mi: Kawemai i te Pouakawhiriwhiri

source: Import from camera
mi: Kawemai i te kāmera

source: Inbox
mi: Pouakauru

source: Incomplete
mi: Pahara

source: Individual messages
mi: karere takitahi

source: Invalid URL
mi: URL Muhu

source: It has problems
mi: He raruraru

source: Item %1$d of %2$d
mi: Te nama take %1$d o %2$d

source: Item %d of %d
mi: Te nama take %1$d o %2$d

source: It’s empty, what are you still doing here.
mi: te reira kau, he aha kei te mahi tonu koutou i konei.

source: Jumps to current day on calendar
mi: Hūpeke ki te ra o nāianei i runga i te maramataka

source: Keep
mi: Kia mau ki

source: LTI Tool
mi: LTI Taputapu

source: Landing Page
mi: Whārangi Tauranga

source: Large file
mi: kōnae nui

source: Later
mi: i muri mai

source: Launch External Tool
mi: Neke Taputapu Waho

source: Legal
mi: Ture

source: Loading...
mi: Utanga ...

source: Locked
mi: Maukatia

source: Locked until %@
mi: Maukatia noa %@

source: Login ID
mi: Takiuru ID

source: Login Problem
mi: Takiuru Raru

source: Logout
mi: Takiuru Out

source: Love it!
mi: Aroha te reira!

source: Mark as Done
mi: Mark rite Oti

source: Masquerade
mi: poupou pakoko

source: Me
mi: Ahau

source: Media Comment
mi: Tākupu Pāpāho

source: Media Submission
mi: Tukunga Pāpāho

source: Media comment
mi: kōrero Pāpāho

source: Media recording
mi: tuhi Pāpāho

source: Media type selector. %@
mi: momo kaikōwhiri Pāpāho. %@

source: Message Instructor
mi: Kaiwhakaako Mirimiri

source: Message Sent.
mi: Tono Karere.

source: Message everyone separately, or add everyone to a group conversation?
mi: Karere katoa wehe, tāpiri katoa ranei ki te aparauraa rōpū?

source: Messages
mi: Karere

source: Mobile Quiz Warning
mi: Whakatūpato Pātaitai Pūkoro

source: Modules
mi: Kōwae

source: More Info
mi: Ētahi atu Mōhiohio

source: Multiple Due Dates
mi: Rā Nā Maha

source: Must contribute
mi: Me whai wāhi

source: Must mark as done
mi: Me Tohua i rite ki ta

source: Must score %@ or higher
mi: Me piro %@ teitei ranei

source: Must submit
mi: Me tuku

source: Must view
mi: Me tiro

source: My Files
mi: Toku Kōnae

source: Name
mi: Ingoa

source: Need SpeedGrader for iPad
mi: Me SpeedGrader hoki iPad

source: Network Error
mi: Hapa Whatunga

source: New Folder
mi: Kōpaki Hou

source: Next 7 Days
mi: Panuku 7 ra

source: Next item
mi: tūemi muri

source: No
mi: Kahore

source: No Date
mi: Kāore he Rā

source: No Due Date
mi: Kāore he Rā whakaoti

source: No Recorded Audio
mi: Kahore Papa'ihia i Ororongo

source: No Submission
mi: Kāore he Tukunga

source: No Thanks
mi: Kāore he Mihi

source: No actions available for this file
mi: Kāore he mahi e wātea ana mō tēnei kōnae

source: No audio was recorded.
mi: I tuhia Kāore he ororongo.

source: No due date
mi: Kāore he rā e tika ana

source: No installed apps support opening this file
mi: No taupānga tāutatia tautoko te whakatuwhera i tēnei kōnae

source: No recipients
mi: Kāore he kaiwhiwhi

source: No results found
mi: kitea he hua

source: Not Authorized
mi: E kore e Faati'ahia te

source: Not Complete
mi: Kāore i te oti

source: Not available
mi: Kāore i te wātea

source: Not graded
mi: E kore e mākahia

source: Not graded (0 out of %@)
mi: E kore e mākahia (0 i roto i te %@)

source: Note: Media files are not immediately available for playback while they are processed on the server.
mi: Mōhio: e kore e tonu e wātea ana ngā kōnae pāpāho mō te purei ia e tukatuka ratou i runga i te tūmau.

source: Nothing to do, go play outside!
mi: Kahore ki te mahi, haere tākaro ki waho!

source: Nothing to see here.
mi: Kahore ki te kite i konei.

source: Notification
mi: Whakamōhiotanga

source: Notification Preferences
mi: Manakohanga Whakamōhiotanga

source: Notifications
mi: Whakamōhiotanga

source: Observer
mi: Kaimātakitaki

source: Online URL
mi: URL Ipurangi

source: Open in Safari
mi: Tuwhera i roto i te Safari

source: Open in SpeedGrader
mi: Tuwhera i roto i te SpeedGrader

source: Open in...
mi: Tuwhera i roto i ...

source: Other
mi: Ētahi atu

source: Other replies hidden until you reply
mi: Ētahi atu whakautu huna noa whakautu koe

source: Outcomes
mi: Putanga

source: Page
mi: Whārangi

source: Past
mi: Mua

source: People
mi: Iwi

source: Pinned Discussions
mi: Matapaki Pinea

source: Play
mi: Tākaro

source: Please check your network connection and try again.
mi: tirohia koa koutou hononga whatunga, me te ngana anō.

source: Post
mi: Pou

source: Post Comment
mi: Pou Tākupu

source: Post comment
mi: Pou Tākupu

source: Posts your comment
mi: Pou koutou kōrero

source: Previous item
mi: tūemi o mua

source: Privacy Policy
mi: Kaupapahere tūmataiti

source: Profile
mi: Kōtaha

source: Quiz
mi: Pātaitai

source: Quiz Alert
mi: Pātaitai Matohi

source: Quizzes
mi: Ngā pātaitai

source: Rate on App Store
mi: Auau i runga i Toa Taupānga

source: Rating for %1$@, Score: %2$g
mi: Whakatauranga mō %1$@, Piro: %2$g

source: Re-submit Assignment
mi: Re-tuku Taumahi

source: Recipients
mi: Kaiwhiwhi

source: Record Audio
mi: Record Ororongo

source: Record Audio...
mi: Record Ororongo ...

source: Record Video
mi: Record Ataata

source: Record audio
mi: Record ororongo

source: Record video
mi: Record ataata

source: Refresh Button
mi: Pātene Tāmata

source: Refreshes the calendar content
mi: Ka ora hoki te ihirangi maramataka

source: Refreshing Calendar Events
mi: Takahanga Maramataka Tāmata

source: Remove
mi: Tangohia te

source: Remove this file?
mi: Tangohia te tenei kōnae?

source: Report a problem
mi: Pūrongo i te raruraru

source: Request a feature
mi: Tono he āhuatanga

source: Save
mi: Tiaki

source: Schedule Notification
mi: Whakamōhiotanga Apiti

source: Search for recipients
mi: Rapu mō ngā kaiwhiwhi

source: Select file(s)
mi: Tīpako kōnae(s)

source: Select or deselect
mi: Tīpakohia whakawātea ranei

source: Selected
mi: Tīpakohia

source: Send
mi: Tukua

source: Send %@ a message
mi: Tukua %@ te karere

source: Send Message
mi: Tukua Karere

source: Sent
mi: Tonoa

source: Settings
mi: Tautuhinga

source: Show Grades
mi: Whakaatu Ngā Kōeke

source: Show Quiz
mi: Whakaatu Pātaitai

source: Show file
mi: Whakaatu kōnae

source: Show recipients
mi: Whakaatu kaiwhiwhi

source: Some items could not be deleted
mi: kihai ētahi tūemi i taea te muku

source: Some selected folders are not empty. Are you sure you want to delete them?
mi: e kore e kau ētahi kōpaki tīpakohia. E tino koe e hiahia ana koe ki te muku ratou?

source: Sorry, we couldn't find the assignment. This assignment may have been deleted.
mi: Aroha mai, kihai i kitea e tatou i te ohipa. kia Kua mukua tēnei taumahi.

source: Starts playing your recording
mi: Tīmata te tākaro koutou tuhi

source: Starts recording a media comment
mi: Tīmata tuhi he kōrero pāpāho

source: Stay Logged In
mi: Noho takiuru

source: Stop
mi: Kāti

source: Stop Masquerading
mi: Kāti e whakaahua ana

source: Stops playing your recording
mi: Mutu tākaro koutou tuhi

source: Stops recording a media comment
mi: Mutu tuhi he kōrero pāpāho

source: Student
mi: Ākonga

source: Submission
mi: Tāpaetanga

source: Submission Error
mi: Hapa Tāpaetanga

source: Submission complete
mi: Tāpaetanga oti

source: Submit
mi: Tuku

source: Submitted
mi: Tukuna

source: Submitting...
mi: Tuku ...

source: Subscribe to calendar feed
mi: Ohauru ki te Maramataka kai

source: Success!
mi: Angitu!

source: Sure!
mi: Papau!

source: Switches media input between audio and video. Currently set to %@
mi: Huri tāuru pāpāho i waenganui i oro me te ataata. I tēnei wā whakaturia ki te %@

source: Switches to media comment mode
mi: Whakakā ki aratau kōrero pāpāho

source: Switches to text comment mode
mi: Whakakā ki aratau kōrero kuputuhi

source: Syllabus
mi: Marautanga

source: Take Photo
mi: Tangohia Photo

source: Take Photo or Video...
mi: Tangohia Photo Ataata ranei ...

source: Take a Photo...
mi: E mau ki te Whakaahua ...

source: Take a Video...
mi: E mau ki te Ataata ...

source: Tap to try again
mi: Pato ki ngana anō

source: Teacher
mi: Kaiako

source: Teachers
mi: Kaiako

source: Tell us what's wrong
mi: Korerotia mai ki a matou he aha te te he

source: Terms of Use
mi: Ngā Ture Whakamahi

source: Text Comment
mi: Tākupu kuputuhi

source: Text Submission
mi: Tāpaetanga Kuputuhi

source: Text entry
mi: tāurunga Kuputuhi

source: The recipients could not be added. Please try again. (%@)
mi: e kore i taea te tāpiri i te kaiwhiwhi. Koa ngana anō. (%@)

source: The server could not be reached
mi: e kore i taea te tae te tūmau

source: The server you entered is not authorized for this app.
mi: E kore te tūmau tomo koutou te mana mo tenei taupānga.

source: The user agent for this app is unauthorized.
mi: Te kaihoko kaiwhakamahi mo tenei taupānga he kāore.

source: There are no actions for this item
mi: Kāore he mahi hoki tenei tūemi

source: There are no items to display
mi: Kāore he tūemi ki te whakaatu

source: There was a network error posting your comment.
mi: He ko he hapa whatunga tuku koutou kōrero.

source: There was a network problem while attempting to upload your submission
mi: He ko he raru whatunga wā e ngana ana ki te tukuatu koutou tāpaetanga

source: There was a problem accessing the requested file. Error: %@
mi: He ko he raruraru whakauru i te kōnae tonoa. Hapa:% @

source: There was a problem launching Safari
mi: He ko he raruraru whakarewa Safari

source: There was an error loading the document.
mi: He ko he hapa utanga i te tuhinga.

source: There was an error loading your content. If it is an audio or video upload it may still be processing.
mi: He ko he hapa uta koutou ihirangi. Ki te mea he ororongo ataata ranei tukuake ai tonu te tukatuka i te reira.

source: This app is not authorized for use.
mi: e kore te tēnei taupānga mana hoki te whakamahi.

source: This assignment doesn't appear to be a valid external tool or is misconfigured.
mi: Kāore tēnei taumahi puta ki te waiho i te taputapu waho whaimana te whirihoranga ranei.

source: This assignment has no details.
mi: kahore kōrero tēnei taumahi.

source: This entry has been deleted
mi: Kua tēnei tāurunga kua mukua

source: This file cannot be displayed on this device.
mi: e kore e taea te whakaatu i tēnei kōnae i runga i tenei pūrere.

source: This file is locked
mi: maukatia tēnei kōnae te

source: This folder is locked
mi: kiia ana tēnei kōpaki te

source: This is a media message.
mi: Ko te karere pāpāho tenei.

source: This would be a great time to do some extra credit.
mi: e riro i te wa nui ki te mahi i te tahi mau nama anō tēnei.

source: To Do
mi: ki te E

source: To:
mi: Ki:

source: Today
mi: Teie mahana

source: Today Button
mi: Pātene Teie mahana

source: Toggles selection of current item
mi: Takahuri kōwhiringa o tūemi onāianei

source: Toggles selection of item
mi: Ka takahuri kōwhiringa o tūemi

source: Turn In
mi: Tahuri I roto i

source: Turn In Again
mi: Tahuri I roto i ano

source: Turn in %@
mi: Tahuri i roto i te %@

source: Uh-oh! No Internet Connection
mi: Uh-oh! Kahore Hononga Ipurangi

source: Unable to load
mi: Kāore e taea te ki te uta

source: Unable to post. Please try again later
mi: Kāore e taea te ki pou. Koa ngana anō i muri mai

source: Unable to upload to server
mi: Kāore e taea te tukuatu ki tūmau

source: Unavailable
mi: Wātea

source: Ungraded
mi: Tē Mākahia

source: Unread
mi: Pānuihia

source: Unsaved Reply
mi: Whakautu Tiaki

source: Upload
mi: Tukuatu

source: Upload Error
mi: Hapa Tukuake

source: Upload a file
mi: Tukua ake he kōnae

source: Upload failed. Reason: (%@)
mi: rahua Tukuake. Take: (%@)

source: Upload file
mi: kōnae Tukuake

source: Upload to assignment "%@" failed
mi: Tukuatu ki ngāue "%@" rahua

source: Upload to assignment &quot;%@&quot; failed
mi: Tukuatu ki te taumahi &quot;%@&quot; rahua

source: Upload to folder "%@" failed
mi: Tukuatu ki kōpaki "%@" rahua

source: Upload to folder &quot;%@&quot; failed
mi: Tukuatu ki te kōnae&quot;%@&quot; rahua

source: Use
mi: Whakamahi

source: User ID
mi: ID Kaiwhakamahi

source: User Info
mi: Info Kaiwhakamahi
